{"task": "relevancy", "last_date_published": "2020-02-28T00:00:00Z", "new_last_date_pulished": "2020-03-10T00:00:00Z", "articles": [{"id": "3dfc5c5b2dbf412a1a8a81d3e421c5de", "title": "On Safety Assessment of Artificial Intelligence", "date_published": "2020-02-29T00:00:00Z", "relevancy": 8, "relevancy_justification": "The research paper discusses safety assessment of AI systems, which is directly relevant to my project on finding novel solutions to AI alignment. The paper provides a detailed discussion on how AI systems can be assessed for safety, including a proposed research challenge that may be decisive for the use of AI in safety-related systems. The paper also provides an academic example of a classification system, which could be useful for understanding and solving similar problems in my project."}, {"id": "50e1a7109df31a843ae823ed54ed2610", "title": "Marketplace for AI Models", "date_published": "2020-03-03T00:00:00Z", "relevancy": 7, "relevancy_justification": "The research paper discusses the creation of an AI marketplace, which is relevant to my project on finding novel solutions to AI alignment. The paper explores the technical, economic, and regulatory aspects of creating such a marketplace, which could potentially help in the diffusion of AI models and datasets. However, the paper does not directly address the specific challenges of AI alignment, which is the primary focus of my project. Therefore, I give it a score of 7 out of 10."}, {"id": "393de4ce26114b76507f296a0fc15512", "title": "Two Decades of AI4NETS-AI/ML for Data Networks: Challenges & Research Directions", "date_published": "2020-03-03T00:00:00Z", "relevancy": 6, "relevancy_justification": "While the research paper discusses the challenges and potential research directions for applying AI/ML to networking, it does not directly address the core problem of AI alignment, which is the focus of the researcher's project. However, the paper does highlight the importance of making AI/ML 'immediately applicable' to large-scale networking problems, which could potentially involve finding novel solutions to overcome the challenges faced in this domain. Additionally, the paper mentions the need for interdisciplinary approaches and teams to tackle the limitations in AI/ML for networking, which is relevant to the researcher's background in AI alignment."}, {"id": "c73d1d24858a5a5824f3f53ecf51ec6b", "title": "Reliable evaluation of adversarial robustness with an ensemble of diverse parameter-free attacks", "date_published": "2020-03-03T18:15:55Z", "relevancy": 8, "relevancy_justification": "The research paper discusses adversarial attacks and defenses, which is directly relevant to AI alignment research. The paper introduces a new evaluation protocol for adversarial defenses, which could be useful for AI alignment researchers to assess the robustness of their models. Additionally, the paper introduces two novel variants of PGD, Auto-PGD and APGD, which could be useful for AI alignment researchers to generate more robust adversarial examples. Finally, the paper introduces a new loss function, the Difference of Logits Ratio loss, which could be useful for AI alignment researchers to evaluate the performance of their models in a more robust manner."}, {"id": "75eae1629d5de358e2e8e72e9984c760", "title": "AutoML-Zero: Evolving Machine Learning Algorithms From Scratch", "date_published": "2020-03-06T00:00:00Z", "relevancy": 7, "relevancy_justification": "The paper discusses AI alignment, which is directly relevant to your research. However, the specific methods and results presented in this section are not directly applicable to your project, as they focus on finding simple neural networks for linear regression tasks. Therefore, the relevancy score is not extremely high."}, {"id": "f6784f1a736cd972c09dec49c7353f4d", "title": "Can ML predict the solution value for a difficult combinatorial problem?", "date_published": "2020-03-06T00:00:00Z", "relevancy": 6, "relevancy_justification": "The research paper discusses the application of machine learning to predict the final objective function value (pattern count) of a difficult combinatorial optimization problem, the pattern reduction problem in the cutting stock problem. While the specific problem and industry context (cutting stock problem in the paper industry) are different from AI alignment, the use of machine learning to predict the outcome of an optimization process is relevant to AI alignment research. The paper also discusses the challenges and limitations of the current approach, which is relevant to the exploration of novel solutions in AI alignment. However, the paper does not directly address AI alignment or related concepts, which is why the relevancy score is not higher."}, {"id": "67acbfb8e5ef736598192ed5586d9eec", "title": "\"Other-Play\" for Zero-Shot Coordination", "date_published": "2020-03-06T00:00:00Z", "relevancy": 8, "relevancy_justification": "The research paper discusses 'other-play' (OP), an algorithm for constructing good strategies for the zero-shot coordination setting, which is directly relevant to AI alignment research. The paper also introduces the concept of 'other-play' as an equilibrium in meta-strategies, which is a key concept in AI alignment. Additionally, the paper evaluates OP in the cooperative card game Hanabi, which is a complex environment that requires coordination and cooperation, making it a relevant benchmark for AI alignment research."}, {"id": "11478ad14bf4519a7e05fcdb1715563f", "title": "Improved Baselines with Momentum Contrastive Learning", "date_published": "2020-03-09T00:00:00Z", "relevancy": 4, "relevancy_justification": "While the paper discusses contrastive learning, which is a broad technique used in AI, it does not directly relate to AI alignment, which is the focus of your project. However, the paper does discuss improvements to contrastive learning, which could potentially be explored in the context of AI alignment. Therefore, I gave a score of 4."}, {"id": "1cf3dc49f86f8b079cde5c3acc994861", "title": "Pruned Neural Networks are Surprisingly Modular", "date_published": "2020-03-10T00:00:00Z", "relevancy": 7, "relevancy_justification": "The research paper discusses the modularity of neural networks, which is a relevant topic in AI alignment research. However, the paper focuses on the modularity of neural networks in terms of their learned weights and does not directly address the problem of AI alignment. Therefore, the relevancy score is 7 out of 10."}, {"id": "81cbc2d99dc5eb23e6adaeaf6f66c9e8", "title": "Retrospective Analysis of the 2019 MineRL Competition on Sample Efficient Reinforcement Learning", "date_published": "2020-03-10T00:00:00Z", "relevancy": 7, "relevancy_justification": "The research paper describes a competition focused on sample efficient reinforcement learning using human priors in Minecraft, which is relevant to AI alignment research. However, it does not directly address the specific project of finding novel solutions to solve AI alignment, which is why the relevancy score is not 10."}]}